Repository: pypi-data/pypi-mirror-60
Catalog: packages/Red-DiscordBot/Red_DiscordBot-3.3.1-py3-none-any.whl/redbot/cogs/cleanup/locales/*.po
Languages: ru_ru

source: Commands for cleaning up messages.
ru_ru: Команды для очистки сообщений.

source: Are you sure you want to delete {number} messages? (y/n)
ru_ru: Вы уверены, что хотите удалить {number} сообщений? (y/n)

source: Cancelled.
ru_ru: Отменено.

source: Delete messages.
ru_ru: Удалить сообщения.

source: Delete the last X messages matching the specified text.\n\n Example:\n `[p]cleanup text \"test\" 5`\n\n Remember to use double quotes.\n
ru_ru: Удаление последних X сообщений, соответствующих указанному тексту.\n\n Пример:\n `[p]cleanup text \"test\" 5`\n\n Не забудьте использовать двойные кавычки.\n

source: Delete the last X messages from a specified user.\n\n Examples:\n `[p]cleanup user @​Twentysix 2`\n `[p]cleanup user Red 6`\n
ru_ru: Удаление последних X сообщений от указанного пользователя.\n\n Пример:\n `[p]cleanup user @​Twentysix 2`\n `[p]cleanup user Red 6`\n

source: Delete all messages after a specified message.\n\n To get a message id, enable developer mode in Discord's\n settings, 'appearance' tab. Then right click a message\n and copy its id.\n
ru_ru: Удаление всех сообщений после указанного сообщения.\n\n Чтобы получить идентификатор сообщения, включите режим разработчика в настройках Discord\n вкладка 'внешний вид'. Затем щелкните правой кнопкой мыши на сообщение\n и скопируйте его ID.\n

source: Message not found.
ru_ru: Сообщение не найдено.

source: Deletes X messages before specified message.\n\n To get a message id, enable developer mode in Discord's\n settings, 'appearance' tab. Then right click a message\n and copy its id.\n
ru_ru: Удаление X сообщений перед указанным сообщением.\n\n Чтобы получить идентификатор сообщения, включите режим разработчика в настройках Discord\n вкладка 'внешний вид'. Затем щелкните правой кнопкой мыши на сообщение\n и скопируйте его ID.\n

source: Delete the messages between Messsage One and Message Two, providing the messages IDs.\n\n The first message ID should be the older message and the second one the newer.\n\n Example:\n `[p]cleanup between 123456789123456789 987654321987654321`\n
ru_ru: Удаление сообщений между Сообщением 1 и Сообщением 2, указав IDs.\n\n Первый ID сообщения должен быть старым, а второй - более новым.\n\n Пример:\n `[p]cleanup между 1234566789123456789 987654321987654321`\n

source: Delete the last X messages.\n\n Example:\n `[p]cleanup messages 26`\n
ru_ru: Удаление последних X сообщений.\n\n Пример:\n `[p]cleanup messages 26`\n

source: Clean up command messages and messages from the bot.
ru_ru: Очистить командные сообщения и сообщения от бота.

source: {} doesn't look like a valid message ID.
ru_ru: {} не похож на действительный ID сообщения.
