Repository: pypi-data/pypi-mirror-60
Catalog: packages/Red-DiscordBot/Red-DiscordBot-3.3.0.tar.gz/Red-DiscordBot-3.3.0/redbot/cogs/admin/locales/*.po
Languages: sv_se

source: I attempted to do something that Discord denied me permissions for. Your command failed to successfully complete.
sv_se: Jag försökte göra något som Discord nekade mig behörighet till. Ditt kommando kunde inte slutföras.

source: I tried to {verb} {role.name} to {member.display_name} but that role is higher than my highest role in the Discord hierarchy so I was unable to successfully add it. Please give me a higher role and try again.
sv_se: Jag försökte att {verb} {role.name} till {member.display_name} men den rollen är högre än min högsta roll i Discords hierarki så jag kunde inte göra det med lyckat resultat. Var god att ge mig en högre roll och försök igen.

source: I tried to {verb} {role.name} to {member.display_name} but that role is higher than your highest role in the Discord hierarchy so I was unable to successfully add it. Please get a higher role and try again.
sv_se: Jag försökte att {verb} {role.name} till {member.display_name} men den rollen är högre än din högsta roll i Discords hierarki så jag kunde inte göra det med lyckat resultat. Var god och införskaffa en högre roll och försök igen.

source: I tried to edit {role.name} but that role is higher than your highest role in the Discord hierarchy so I was unable to successfully add it. Please get a higher role and try again.
sv_se: Jag försökte redigera {role.name} men den rollen är högre än din högsta roll i Discords hierarki så jag kunde inte göra det med lyckat resultat. Var god införskaffa en högre roll och försök igen.

source: I am already announcing something. If you would like to make a different announcement please use `{prefix}announce cancel` first.
sv_se: Jag tillkännager redan något. Om du vill göra ett annat tillkännagivande, vänligen använd `{prefix}announce cancel` först.

source: A collection of server administration utilities.
sv_se: En samling administrationsverktyg för servern.

source: add
sv_se: lägg till

source: I successfully added {role.name} to {member.display_name}
sv_se: Jag lyckades lägga till {role.name} till {member.display_name}

source: remove
sv_se: ta bort

source: I successfully removed {role.name} from {member.display_name}
sv_se: Jag lyckades ta bort {role.name} från {member.display_name}

source: Add a role to a user.\n\n If user is left blank it defaults to the author of the command.\n
sv_se: Lägg till en roll till en användare.\n\n Om användaren lämnas tomt så är det standardinställningen för skaparen av kommandot.\n

source: Remove a role from a user.\n\n If user is left blank it defaults to the author of the command.\n
sv_se: Ta bort en roll till en användare.\n\n Om användaren lämnas tomt så är det standardinställningen för skaparen av kommandot.\n

source: Edit role settings.
sv_se: Redigera rollinställningar.

source: Edit a role's colour.\n\n Use double quotes if the role contains spaces.\n Colour must be in hexadecimal format.\n [Online colour picker](http://www.w3schools.com/colors/colors_picker.asp)\n\n Examples:\n `[p]editrole colour \"The Transistor\" #ff0000`\n `[p]editrole colour Test #ff9900`\n
sv_se: Redigera en rolls färg.\n\n Använd dubbla citat om rollen innehåller mellanslag.\n Färgen måste vara i hexadecimalt format.\n [Online färgväljare] (http://www.w3schools. om/colors/colors_picker. sp)\n\n Exempel:\n `[p]editrole färg \"The Transistor\" #ff0000`\n `[p]editrole colour Test #ff9900`\n

source: Done.
sv_se: Klart.

source: Edit a role's name.\n\n Use double quotes if the role or the name contain spaces.\n\n Examples:\n `[p]editrole name \"The Transistor\" Test`\n
sv_se: Redigera en rolls namn.\n\n Använd dubbla citat om rollen eller namnet innehåller mellanslag.\n\n Exempel:\n `[p]editrole name \"The Transistor\" Test`\n

source: Announce a message to all servers the bot is in.
sv_se: Meddela ett meddelande till alla servrar som botten är i.

source: The announcement has begun.
sv_se: Tillkännagivandet har börjat.

source: Cancel a running announce.
sv_se: Avbryt en löpande avisering.

source: The current announcement has been cancelled.
sv_se: Det aktuella meddelandet har avbrutits.

source: Change the channel to which the bot makes announcements.
sv_se: Ändra den kanal till vilken botten gör tillkännagivanden.

source: The announcement channel has been set to {channel.mention}
sv_se: Tillkännagivandekanalen har satts till {channel.mention}

source: Toggle announcements being enabled this server.
sv_se: Växla tillkännagivanden som aktiveras den här servern.

source: The server {guild.name} will receive announcements.
sv_se: Servern {guild.name} kommer att få tillkännagivanden.

source: The server {guild.name} will not receive announcements.
sv_se: Servern {guild.name} kommer inte att få tillkännagivanden.

source: Add a role to yourself.\n\n Server admins must have configured the role as user settable.\n\n NOTE: The role is case sensitive!\n
sv_se: Lägg till en roll för dig själv.\n\n Serveradministratörer måste ha konfigurerat rollen som användarinställning.\n\n OBS: Rollen är skiftlägeskänslig!\n

source: Remove a selfrole from yourself.\n\n NOTE: The role is case sensitive!\n
sv_se: Ta bort en självroll från dig själv.\n\n OBS: Rollen är skiftlägeskänslig!\n

source: Add a role to the list of available selfroles.\n\n NOTE: The role is case sensitive!\n
sv_se: Lägg till en roll i listan över tillgängliga självroller.\n\n OBS: Rollen är skiftlägeskänslig!\n

source: The selfroles list has been successfully modified.
sv_se: Listan över självroller har ändrats framgångsrikt.

source: Remove a role from the list of available selfroles.\n\n NOTE: The role is case sensitive!\n
sv_se: Ta bort en roll från listan över tillgängliga självroller.\n\n OBS: Rollen är skiftlägeskänslig!\n

source: \n Lists all available selfroles.\n
sv_se: \n Listar alla tillgängliga självroller.\n

source: Available Selfroles:\n{selfroles}
sv_se: Tillgängliga Selfroles:\n{selfroles}

source: Lock a bot to its current servers only.
sv_se: Lås en bot till sina nuvarande servrar.

source: The bot is no longer serverlocked.
sv_se: Botten är inte längre serverlåst.

source: The bot is now serverlocked.
sv_se: Botten är nu serverlåst.

source: I could not announce to server: {server.id}
sv_se: Jag kunde inte göra ett tillkännagivande till servern: {server.id}

source: The Admin cog is not loaded.
sv_se: Admin cog är inte laddad.

source: The provided role is not a valid selfrole.
sv_se: Den angivna rollen är inte en giltig självroll.
