Repository: pypi-data/pypi-mirror-60
Catalog: packages/cciaapd.contenttypes/cciaapd.contenttypes-1.3.0.tar.gz/cciaapd.contenttypes-1.3.0/src/cciaapd/contenttypes/locales/*/LC_MESSAGES/cciaapd.contenttypes.po
Languages: it

source: Add Scheda Portlet
it: Aggiungi Portlet Scheda

source: Add Ufficio Portlet
it: Aggiungi Ufficio Portlet

source: Body text
it: Testo

source: Edit Scheda Portlet
it: Modifica Portlet Scheda

source: Edit Ufficio Portlet
it: Modifica Portlet Ufficio

source: contacts_references_label
it: Contatti e riferimenti

source: label_related_office
it: Ufficio correlato

source: office_duties_label
it: Competenze dell'ufficio

source: office_executive_label
it: Dirigente

source: office_location_label
it: Sede

source: office_pec_label
it: PEC

source: office_phone_label
it: Tel

source: office_timetable_description
it: Uno per riga.

source: office_timetable_label
it: Orari

source: proceedings_label
it: Elenco attività gestite dall'ufficio
