Repository: pypi-data/pypi-mirror-60
Catalog: packages/Red-DiscordBot/Red_DiscordBot-3.3.0-py3-none-any.whl/redbot/cogs/alias/locales/*.po
Languages: ar_sa, de_de

source: Create aliases for commands.\n\n Aliases are alternative names shortcuts for commands. They\n can act as both a lambda (storing arguments for repeated use)\n or as simply a shortcut to saying \"x y z\".\n\n When run, aliases will accept any additional arguments\n and append them to the stored alias.\n
ar_sa: إنشاء أسماء مستعارة للأوامر. \ n \ n الأسماء المستعارة هي اختصارات أسماء بديلة للأوامر. يمكنهم \ n العمل كحمل لامدا (تخزين الوسائط للاستخدام المتكرر) \ n أو ببساطة اختصار للقول \ "xyz \". \ n \ n عند التشغيل ، ستقبل الأسماء المستعارة أي وسيطات إضافية \ n وتضيفها إلى الاسم المستعار المخزن. \ n
de_de: Erstelle Aliasse für Befehle.\n\n Aliasse sind alternative Namenskürzel für Befehle. Sie können als\n Lambda-Funktion dienen (Argumente können in der Funktion beliebig\n verwendet werden) oder als einfache Abkürzung um z. B. \"x y z\" zu\n sagen.\n\n Wenn ausgeführt, akzeptieren Aliasse jedes zusätzliche Argument und\n fügen es dem gespeicherten Alias an.\n

source: Arguments must be specified with a number.
ar_sa: يجب تحديد الوسائط برقم.
de_de: Argumente müssen als Zahl angegeben werden.

source: Arguments must be sequential. Missing arguments:
ar_sa: يجب أن تكون الوسائط متسلسلة. الوسائط المفقودة:
de_de: Argumente müssen sequentiell sein. Fehlende Argumente:

source: No prefix found.
ar_sa: لم يتم العثور على prefix
de_de: Präfix nicht gefunden.

source: Manage command aliases.
ar_sa: إدارة الأسماء المستعارة للأوامر.
de_de: Verwalte Befehlsaliase.

source: Manage global aliases.
ar_sa: إدارة الأسماء المستعارة العالمية.
de_de: Verwalte globale Befehlsaliase.

source: Add an alias for a command.
ar_sa: إضافة اسم مستعار للأمر.
de_de: Füge einen Alias für einen Befehl hinzu.

source: You attempted to create a new alias with the name {name} but that name is already a command on this bot.
ar_sa: لقد حاولت إنشاء اسم مستعار جديد باسم {name} ولكن هذا الاسم هو بالفعل أمر في هذا الروبوت.
de_de: Du hast versucht, einen neuen Alias ​​mit dem Namen {name} zu erstellen, aber {name} ist bereits ein Befehl für diesen Bot.

source: You attempted to create a new alias with the name {name} but that alias already exists on this server.
ar_sa: لقد حاولت إنشاء اسم مستعار جديد يحمل الاسم {name} ولكن هذا الاسم المستعار موجود بالفعل على هذا الخادم.
de_de: Du hast versucht einen neuen Alias mit dem Namen {name} zu erstellen, aber dieser Alias existiert bereits auf dem Server.

source: You attempted to create a new alias with the name {name} but that name is an invalid alias name. Alias names may not contain spaces.
ar_sa: لقد حاولت إنشاء اسم مستعار جديد بالاسم {name} ولكن هذا الاسم هو اسم مستعار غير صالح. قد لا تحتوي أسماء الاسم المستعار على مسافات.
de_de: Du hast versucht einen neuen Alias mit dem Namen {name} zu erstellen. Dies ist jedoch nicht möglich, da Alias-Namen keine Leerzeichen enthalten dürfen.

source: A new alias with the trigger `{name}` has been created.
ar_sa: تم إنشاء اسم مستعار جديد يحتوي على المشغل `{name}.
de_de: Ein neuer alias mit dem Trigger `{name}` wurde erstellt.

source: Add a global alias for a command.
ar_sa: أضف اسمًا مستعارًا عامًا لأحد الأوامر.
de_de: Füge einen globalen Alias für einen Befehl hinzu.

source: You attempted to create a new global alias with the name {name} but that name is already a command on this bot.
ar_sa: لقد حاولت إنشاء اسم مستعار عالمي جديد بالاسم {name} ولكن هذا الاسم هو بالفعل أمر في هذا الروبوت.
de_de: Du hast versucht, einen neuen globalen Alias ​​mit dem Namen {name} zu erstellen, aber {name} ist bereits ein Befehl für diesen Bot.

source: You attempted to create a new global alias with the name {name} but that alias already exists on this server.
ar_sa: لقد حاولت إنشاء اسم مستعار عام جديد يحمل الاسم {name} ولكن هذا الاسم المستعار موجود بالفعل على هذا الخادم.
de_de: Du hast versucht, einen neuen globalen Alias mit dem Namen {name} zu erstellen, dieser ist jedoch bereits auf diesem Server vorhanden.

source: You attempted to create a new global alias with the name {name} but that name is an invalid alias name. Alias names may not contain spaces.
ar_sa: لقد حاولت إنشاء اسم مستعار عالمي جديد بالاسم {name} ولكن هذا الاسم هو اسم مستعار غير صالح. قد لا تحتوي أسماء الاسم المستعار على مسافات.
de_de: Du hast versucht einen globalen Alias mit dem Namen {name} zu erstellen. Dies ist jedoch nicht möglich, da Alias-Namen keine Leerzeichen enthalten dürfen.

source: A new global alias with the trigger `{name}` has been created.
ar_sa: تم إنشاء اسم مستعار عالمي جديد مع المشغل `{name}.
de_de: Ein neuer globaler Alias mit dem Trigger `{name}` wurde erstellt.

source: Try to execute help for the base command of the alias.
ar_sa: حاول تنفيذ التعليمات للأمر الأساسي للاسم المستعار.
de_de: Zeigt die Hilfe des Basisbefehls.

source: {prefix}help {command}
de_de: {prefix}Hilfe{command}

source: No such alias exists.
ar_sa: لا يوجد مثل هذا الاسم المستعار.
de_de: Dieser Alias existiert nicht.

source: Show what command the alias executes.
ar_sa: أظهر ما أمر تنفيذ الاسم المستعار.
de_de: Zeige den Basisbefehl.

source: The `{alias_name}` alias will execute the command `{command}`
ar_sa: `{alias_name}` الاسم المستعار سينفذ الأمر `{command}`
de_de: Der Alias '{alias_name}' führt den Befehl '{command}' aus

source: There is no alias with the name `{name}`
ar_sa: لا يوجد اسم مستعار يحمل الاسم `{name}`
de_de: Kein Alias mit dem Namen '{name}' gefunden

source: Delete an existing alias on this server.
ar_sa: حذف اسم مستعار موجود على هذا الخادم.
de_de: Lösche einen Alias auf diesem Server.

source: There are no aliases on this server.
ar_sa: الخادم خادم الفتنة لا توجد أسماء مستعارة على هذا الخادم.
de_de: Es gibt keine Aliasse auf diesem Server.

source: Alias with the name `{name}` was successfully deleted.
ar_sa: تم حذف الاسم المستعار الذي يحمل الاسم `{name}` بنجاح.
de_de: Der Alias '{name}' wurde erfolgreich gelöscht.

source: Alias with name `{name}` was not found.
ar_sa: لم يتم العثور على الاسم المستعار الذي يحمل الاسم `{name}`.
de_de: Kein Alias mit dem Namen '{name}' gefunden.

source: Delete an existing global alias.
ar_sa: حذف اسم مستعار عالمي موجود.
de_de: Lösche einen globalen Alias.

source: There are no aliases on this bot.
ar_sa: لا توجد أسماء مستعارة في هذا الروبوت.
de_de: Es gibt keine Aliasse in diesem Bot.

source: List the available aliases on this server.
ar_sa: قائمة الأسماء المستعارة المتاحة على هذا الخادم.
de_de: Zeige alle auf diesem Server verfügbaren Aliasse.

source: Aliases:
ar_sa: اسماء مستعارة:
de_de: Aliasse:

source: List the available global aliases on this bot.
ar_sa: قائمة الأسماء المستعارة العالمية المتاحة على هذا الروبوت.
de_de: Zeige alle globalen Aliasse.
