Repository: pypi-data/pypi-mirror-60
Catalog: packages/Red-DiscordBot/Red-DiscordBot-3.3.0.tar.gz/Red-DiscordBot-3.3.0/redbot/cogs/alias/locales/*.po
Languages: tr_tr

source: Create aliases for commands.\n\n Aliases are alternative names shortcuts for commands. They\n can act as both a lambda (storing arguments for repeated use)\n or as simply a shortcut to saying \"x y z\".\n\n When run, aliases will accept any additional arguments\n and append them to the stored alias.\n
tr_tr: Komutlar için kısaltma yaratır.\n\n Kısaltmalar, komutlar için alternatiftir. Hem\n kısaltma hem de komut bir arada kullanılabilir\n Sadece kısaltmalar da kullanılabilir \"x y z\".\n\n Çalıştırıldığında, diğer adlar ek bağımsız değişkenleri\n kabul eder ve bunları depolanan diğer ada ekler.\n

source: Arguments must be specified with a number.
tr_tr: Girdiler numara ile özelleştirilmiş olmalıdır.

source: Arguments must be sequential. Missing arguments:
tr_tr: Girdiler sırayla olmalıdır. Eksik girdiler:

source: No prefix found.
tr_tr: Ön ek bulunamadı.

source: Manage command aliases.
tr_tr: Komut kısaltmalarını yönet

source: Manage global aliases.
tr_tr: Küresel kısaltmaları yönet

source: Add an alias for a command.
tr_tr: Bir komut için kısaltma ekler.

source: You attempted to create a new alias with the name {name} but that name is already a command on this bot.
tr_tr: {name} ile bir kısaltma oluşturmaya çalıştınız ancak bot böyle bir komuta sahip.

source: You attempted to create a new alias with the name {name} but that alias already exists on this server.
tr_tr: {name} ile bir kısaltma oluşturmaya çalıştınız ancak sunucu bu kısaltmaya zaten sahip.

source: You attempted to create a new alias with the name {name} but that name is an invalid alias name. Alias names may not contain spaces.
tr_tr: {name} ile bir kısaltma oluşturmaya çalıştınız ancak bu kısaltma geçerli değil. Kısaltmalar boşluk içeremez.

source: A new alias with the trigger `{name}` has been created.
tr_tr: `{name}` kısaltması eklendi.

source: Add a global alias for a command.
tr_tr: Bir komut için küresel bir kısaltma ekler.

source: You attempted to create a new global alias with the name {name} but that name is already a command on this bot.
tr_tr: {name} ile küresel bir kısaltma oluşturmaya çalıştınız ancak bot böyle bir komuta sahip.

source: You attempted to create a new global alias with the name {name} but that alias already exists on this server.
tr_tr: {name} ile küresel bir kısaltma oluşturmaya çalıştınız ancak sunucu böyle bir komuta sahip.

source: You attempted to create a new global alias with the name {name} but that name is an invalid alias name. Alias names may not contain spaces.
tr_tr: {name} ile küresel bir kısaltma oluşturmaya çalıştınız ancak bu kısaltma geçerli değil. Kısaltmalar boşluk içeremez.

source: A new global alias with the trigger `{name}` has been created.
tr_tr: Yeni bir küresel diğer ad tetikleyici '{name}' ile oluşturuldu.

source: Try to execute help for the base command of the alias.
tr_tr: Kısaltma için help komutu çalıştırabilirsiniz.

source: No such alias exists.
tr_tr: Böyle bir kısaltma bulunmamakta.

source: Show what command the alias executes.
tr_tr: Kısaltmanın hangi komutu çalıştırdığını gösterir.

source: The `{alias_name}` alias will execute the command `{command}`
tr_tr: '{alias_name}' kısaltması bu '{command} ' komutunu çalıştıracak.

source: There is no alias with the name `{name}`
tr_tr: '{name} ' isminde bir kısaltma bulunmuyor.

source: Delete an existing alias on this server.
tr_tr: Bu sunucu da ki bir kısaltmayı kaldırır.

source: There are no aliases on this server.
tr_tr: Bu sunucu da hiçbir kısaltma bulunmuyor.

source: Alias with the name `{name}` was successfully deleted.
tr_tr: `{name}`adlı kısaltma başarıyla silindi.

source: Alias with name `{name}` was not found.
tr_tr: {Name} `adlı kısaltma bulunamadı.

source: Delete an existing global alias.
tr_tr: Mevcut bir küresel kısaltmayı siler.

source: There are no aliases on this bot.
tr_tr: Bu botta herhangi bir kısaltma bulunmuyor.

source: List the available aliases on this server.
tr_tr: Bu sunucudaki kullanılabilir kısaltmaları listeler.

source: Aliases:
tr_tr: Kısaltmalar:

source: List the available global aliases on this bot.
tr_tr: Bu botta bulunan küresel kısaltmaları listeler.
