Repository: pypi-data/pypi-mirror-60
Catalog: packages/Red-DiscordBot/Red-DiscordBot-3.3.1.tar.gz/Red-DiscordBot-3.3.1/redbot/cogs/admin/locales/*.po
Languages: de_de

source: I attempted to do something that Discord denied me permissions for. Your command failed to successfully complete.
de_de: Ich habe versucht etwas zu tun, für das ich vermutlich keine Berechtigungen habe. Dein Befehl konnte nicht erfolgreich ausgeführt werden.

source: I tried to {verb} {role.name} to {member.display_name} but that role is higher than my highest role in the Discord hierarchy so I was unable to successfully add it. Please give me a higher role and try again.
de_de: Ich habe versucht {member.display_name} er Rolle: {role.name} {verb}, aber diese Rolle hat höhere Rechte als ich. Also war es nicht möglich die Rolle erfolgreich hinzuzufügen. Bitte geb mir eine höhere Rolle und versuche es erneut.

source: I tried to {verb} {role.name} to {member.display_name} but that role is higher than your highest role in the Discord hierarchy so I was unable to successfully add it. Please get a higher role and try again.
de_de: Ich habe versucht die Rolle {role.name} an {member.display_name} zu {verb}, aber die Rolle ist höher als meine Rolle in der Discord Hierarchie, daher war es mir nicht möglich sie hinzuzufügen. Bitte gib mir eine höhere Rolle und versuche es erneut.

source: I tried to edit {role.name} but that role is higher than your highest role in the Discord hierarchy so I was unable to successfully add it. Please get a higher role and try again.
de_de: Ich habe versucht {role.name} zu bearbeiten, aber die Rolle ist höher als deine höhste Rolle im Discord. Also konnte ich dies nicht erfolgreich hinzufügen. Versuche es mit einer höheren Rolle erneut.

source: I am already announcing something. If you would like to make a different announcement please use `{prefix}announce cancel` first.
de_de: Ich kündige bereits etwas an. Wenn du eine andere Ankündigung machen willst, benutze bitte zuerst `{prefix}announce cancel`.

source: A collection of server administration utilities.
de_de: Eine Sammlung von Serververwaltungstools.

source: add
de_de: hinzuzufügen

source: I successfully added {role.name} to {member.display_name}
de_de: Ich habe erfolgreich {role.name} zu {member.display_name} hinzugefügt

source: remove
de_de: entfernen

source: I successfully removed {role.name} from {member.display_name}
de_de: Ich habe {role.name} erfolgreich von {member.display_name} entfernt

source: Add a role to a user.\n\n If user is left blank it defaults to the author of the command.\n
de_de: Füge einem Benutzer eine Rolle hinzu.\n\n Wenn kein Benutzer angegeben wird, wird standardmäßig der Autor des Befehls gewählt.\n

source: Remove a role from a user.\n\n If user is left blank it defaults to the author of the command.\n
de_de: Entferne eine Rolle von einem Benutzer.\n\n Wenn kein Benutzer angegeben wird, wird standardmäßig der Autor des Befehls gewählt.\n

source: Edit role settings.
de_de: Bearbeiten der Rollen Einstellungen.

source: Edit a role's colour.\n\n Use double quotes if the role contains spaces.\n Colour must be in hexadecimal format.\n [Online colour picker](http://www.w3schools.com/colors/colors_picker.asp)\n\n Examples:\n `[p]editrole colour \"The Transistor\" #ff0000`\n `[p]editrole colour Test #ff9900`\n
de_de: Bearbeite die Farbe einer Rolle.\n\n Benutze Anführungszeichen wenn die Rolle ein Leerzeichen enthält.\n Die Farbe muss im Hexadezimal Format angegeben werden.\n [Online Farbwähler](<http://www.w3schools.com/colors/colors_picker.asp>)\n\n Beispiele:\n `[p]editrole colour \"The Transistor\" #ff0000`\n `[p]editrole colour Test #ff9900`\n

source: Done.
de_de: Erledigt.

source: Edit a role's name.\n\n Use double quotes if the role or the name contain spaces.\n\n Examples:\n `[p]editrole name \"The Transistor\" Test`\n
de_de: Bearbeite den Namen einer Rolle.\n\n Benutze Anführungszeichen wenn die Rolle Leerzeichen enthält.\n\n Beispiele:\n `[p]editrole name \"The Transistor\" Test`\n

source: Announce a message to all servers the bot is in.
de_de: Sende eine Ankündigung in allen Servern auf denen der Bot ist.

source: The announcement has begun.
de_de: Die Ankündigung hat begonnen.

source: Cancel a running announce.
de_de: Brich eine laufende Ankündigung ab.

source: The current announcement has been cancelled.
de_de: Die aktuelle Ankündigung wurde abgebrochen.

source: Change the channel to which the bot makes announcements.
de_de: Ändere den Channel, in dem der Bot Ankündigungen macht.

source: The announcement channel has been set to {channel.mention}
de_de: Ankündigungen werden nun in {channel.mention} gesendet.

source: Toggle announcements being enabled this server.
de_de: Schaltet Ankündigungen auf diesem Server ein oder aus.

source: The server {guild.name} will receive announcements.
de_de: Der Server {guild.name} wird Ankündigunen erhalten.

source: The server {guild.name} will not receive announcements.
de_de: Der Server {guild.name} wird keine Ankündigunen erhalten.

source: Add a role to yourself.\n\n Server admins must have configured the role as user settable.\n\n NOTE: The role is case sensitive!\n
de_de: Gib dir selbst eine Rolle.\n\n Server Admins müssen die Rolle für Nutzer freigeben.\n\n HINWEIS: Beachte Groß- und Kleinschreibung!\n

source: Remove a selfrole from yourself.\n\n NOTE: The role is case sensitive!\n
de_de: Entferne eine Rolle von dir selbst.\n\n HINWEIS: Beachte Groß- und Kleinschreibung!\n

source: Add a role to the list of available selfroles.\n\n NOTE: The role is case sensitive!\n
de_de: Füge eine Rolle zur Liste der selbst auswählbaren Rollen hinzu.\n\n HINWEIS: Beachte Groß- und Kleinschreibung!\n

source: The selfroles list has been successfully modified.
de_de: Die Liste der selbst auswählbarer Rollen wurde erfolgreich bearbeitet.

source: Remove a role from the list of available selfroles.\n\n NOTE: The role is case sensitive!\n
de_de: Entferne eine selbst auswählbare Rolle von der Liste der verfügbaren Rollen.\n\n HINWEIS: Beachte Groß- und Kleinschreibung!\n

source: \n Lists all available selfroles.\n
de_de: \nGibt eine Liste verfügbarer selbst auswählbarer Rollen aus.\n

source: Available Selfroles:\n{selfroles}
de_de: Verfügbare, selbst auswählbare Rollen:\n{selfroles}

source: Lock a bot to its current servers only.
de_de: Beschränkt den Bot auf die aktuellen Server.

source: The bot is no longer serverlocked.
de_de: Der Bot kann jetzt wieder anderen Servern beitreten.

source: The bot is now serverlocked.
de_de: Der Bot kann jetzt keinen weiteren Servern mehr beitreten.

source: I could not announce to server: {server.id}
de_de: Ich konnte keine Ankündigung an diesen Server senden: {server.id}

source: The Admin cog is not loaded.
de_de: Das Admin-Cog ist nicht geladen.

source: The provided role is not a valid selfrole.
de_de: Die angegebene Rolle ist keine selbst hinzufügbare Rolle.
