Repository: pypi-data/pypi-mirror-60
Catalog: packages/Red-DiscordBot/Red-DiscordBot-3.3.1.tar.gz/Red-DiscordBot-3.3.1/redbot/cogs/streams/locales/*.po
Languages: ru_ru

source: Check if a Twitch channel is live.
ru_ru: Статус Twitch-канала.

source: Check if a YouTube channel is live.
ru_ru: Статус YouTube-канала.

source: Check if a Hitbox channel is live.
ru_ru: Статус Hitbox-канала.

source: Check if a Mixer channel is live.
ru_ru: Статус Mixer-канала.

source: Check if a Picarto channel is live.
ru_ru: Статус Picarto-канала.

source: That user is offline.
ru_ru: Этот пользователь не в сети.

source: That channel doesn't seem to exist.
ru_ru: Кажется, этот канал не существует.

source: The Twitch token is either invalid or has not been set. See `{prefix}streamset twitchtoken`.
ru_ru: Токен Twitch либо недействителен, либо не был установлен. См. `{prefix}streamset twitchtoken`.

source: The YouTube API key is either invalid or has not been set. See `{prefix}streamset youtubekey`.
ru_ru: Ключ API YouTube либо недействителен, либо не был установлен. См. `{prefix}streamset youtubekey`.

source: Something went wrong whilst trying to contact the stream service's API.
ru_ru: Что-то пошло не так при попытке связаться с API потокового сервиса.

source: Manage automated stream alerts.
ru_ru: Управление автоматическими уведомлениями трансляций.

source: Manage Twitch stream notifications.
ru_ru: Управление Twitch уведомлениями.

source: Toggle alerts in this channel for a Twitch stream.
ru_ru: Переключить оповещения в этом канале для трансляции Twitch.

source: Please supply the name of a *Twitch* channel, not a Discord channel.
ru_ru: Пожалуйста укажите имя Twitch-канала, а не Discord-канала.

source: Toggle alerts in this channel for a YouTube stream.
ru_ru: Переключить оповещения на этом канале для трансляции YouTube.

source: Toggle alerts in this channel for a Hitbox stream.
ru_ru: Переключить оповещения на этом канале для трансляции Hitbox.

source: Toggle alerts in this channel for a Mixer stream.
ru_ru: Переключить оповещения на этом канале для трансляции Mixer.

source: Toggle alerts in this channel for a Picarto stream.
ru_ru: Переключить оповещения на этом канале для трансляции Picarto.

source: Disable all stream alerts in this channel or server.\n\n `[p]streamalert stop` will disable this channel's stream\n alerts.\n\n Do `[p]streamalert stop yes` to disable all stream alerts in\n this server.\n
ru_ru: Отключение всех оповещений о трансляциях в текущем канале или сервере. `[p]streamalert stop` отключит оповещения в текущем канале. Выполните `[p]streamalert stop yes` чтобы отключить все оповещения в текущем сервере.

source: All the stream alerts in this server have been disabled.
ru_ru: Все оповещения о трансляциях на этом сервере были отключены.

source: All the stream alerts in this channel have been disabled.
ru_ru: Все оповещения о трансляциях в этом канале отключены.

source: List all active stream alerts in this server.
ru_ru: Список всех активных уведомлений о трансляциях на этом сервере.

source: Active alerts:\n\n
ru_ru: Активные уведомления:

source: There are no active alerts in this server.
ru_ru: В этом сервере нет активных уведомлений.

source: Set tokens for accessing streams.
ru_ru: Установить токены для доступа к трансляциям.

source: Manage custom message for stream alerts.
ru_ru: Управление пользовательскими сообщениями уведомлений о трансляциях.

source: Stream alert message set!
ru_ru: Сообщение уведомления о трансляции установлено!

source: Reset the stream alert messages in this server.
ru_ru: Сброс сообщений уведомлений о трансляции в текущем сервере.

source: Manage mention settings for stream alerts.
ru_ru: Управление настройками упоминаний для уведомлений о трансляциях.

source: Toggle the `@​everyone` mention.
ru_ru: Переключить упоминание `@​everyone`.

source: `@​everyone` will no longer be mentioned for stream alerts.
ru_ru: Упоминание `@​everyone` больше не будет использоваться в уведомлениях.

source: When a stream is live, `@​everyone` will be mentioned.
ru_ru: Когда трансляция в эфире, будет использоваться `@everyone`.

source: Toggle the `@​here` mention.
ru_ru: Переключить упоминание `@​here`.

source: `@​here` will no longer be mentioned for stream alerts.
ru_ru: Упоминание `@​here` больше не будет использоваться в уведомлениях.

source: When a stream is live, `@​here` will be mentioned.
ru_ru: Когда трансляция в эфире, будет использоваться `@​here`.

source: Toggle a role mention.
ru_ru: Переключить упоминание роли.

source: `@​{role.name}` will no longer be mentioned for stream alerts.
ru_ru: Упоминание `@​{role.name}` больше не будет использоваться в уведомлениях.

source: When a stream or community is live, `@​{role.name}` will be mentioned.
ru_ru: Когда будет транслироваться поток или сообщество, будет использоваться `@​{role.name}`.

source: Since the role is not mentionable, it will be momentarily made mentionable when announcing a streamalert. Please make sure I have the correct permissions to manage this role, or else members of this role won't receive a notification.
ru_ru: Поскольку роль не может быть упомянута, она станет на мгновение упоминаемой при уведомлении о трансляции. Убедитесь, что у меня есть необходимые разрешения для управления этой ролью, иначе члены этой роли не получат уведомление.

source: Toggle alert deletion for when streams go offline.
ru_ru: Переключить удаление уведомлений при окончании трансляции.

source: The notifications will be deleted once streams go offline.
ru_ru: Уведомления будут удалены при окончании трансляции.

source: Notifications will no longer be deleted.
ru_ru: Уведомления больше не будут удаляться.

source: I'll now send a notification in this channel when {stream.name} is live.
ru_ru: Теперь я буду отправлять уведомление в этом канале, когда {stream.name} будет активен.

source: I won't send notifications about {stream.name} in this channel anymore.
ru_ru: Я больше не буду отправлять уведомления о {stream.name} в этом канале.

source: {mention}, {stream.name} is live!
ru_ru: {mention}, {stream.name} начал трансляцию!

source: {stream.name} is live!
ru_ru: {stream.name} начал трансляцию!

source: Followers
ru_ru: Подписчики

source: Total views
ru_ru: Всего просмотров

source: Playing:
ru_ru: Воспроизводится:

source: None
ru_ru: Нет

source: {adult}Category: {category} | Tags: {tags}
ru_ru: {adult}Категория: {category} | Теги: {tags}
