Repository: pypi-data/pypi-mirror-60
Catalog: packages/Red-DiscordBot/Red_DiscordBot-3.3.1-py3-none-any.whl/redbot/cogs/alias/locales/*.po
Languages: es_es

source: Create aliases for commands.\n\n Aliases are alternative names shortcuts for commands. They\n can act as both a lambda (storing arguments for repeated use)\n or as simply a shortcut to saying \"x y z\".\n\n When run, aliases will accept any additional arguments\n and append them to the stored alias.\n
es_es: Crear alias para comandos.\n\n Los alias son accesos directos de nombres alternativos para comandos.\n pueden actuar como un lambda (almacenando argumentos para uso repetido)\n o simplemente como un atajo para decir \"x y z\".\n\n Cuando se ejecuta, los alias aceptarán cualquier argumento adicional\n y los agregarán al alias almacenado.\n

source: Arguments must be specified with a number.
es_es: Los argumentos deben especificarse con un número.

source: Arguments must be sequential. Missing arguments:
es_es: Los argumentos deben ser secuenciales. Faltan argumentos:

source: No prefix found.
es_es: Prefijo no encontrado.

source: Manage command aliases.
es_es: Administrar los alias de los comandos.

source: Manage global aliases.
es_es: Administrar los alias de los comandos.

source: Add an alias for a command.
es_es: Agregar un alias para un comando.

source: You attempted to create a new alias with the name {name} but that name is already a command on this bot.
es_es: Intentaste crear un nuevo alias con el nombre {name} pero ese nombre ya es un comando en este bot.

source: You attempted to create a new alias with the name {name} but that alias already exists on this server.
es_es: Intentaste crear un nuevo alias con el nombre {name} pero ese alias ya existe en este servidor.

source: You attempted to create a new alias with the name {name} but that name is an invalid alias name. Alias names may not contain spaces.
es_es: Intentaste crear un nuevo alias con el nombre {name} pero ese nombre es un alias inválido. Los alias no deben contener espacios.

source: A new alias with the trigger `{name}` has been created.
es_es: Un alias nuevo ha creado con el activación {name} fue creado.

source: Add a global alias for a command.
es_es: Agregar un alias global para un comando.

source: You attempted to create a new global alias with the name {name} but that name is already a command on this bot.
es_es: Intentaste crear un nuevo alias global con ese nombre {name} pero ese nombre ya es un comando en este bot.

source: You attempted to create a new global alias with the name {name} but that alias already exists on this server.
es_es: Intentaste crear un nuevo alias global con el nombre {name}, pero ese alias ya existe en este servidor.

source: You attempted to create a new global alias with the name {name} but that name is an invalid alias name. Alias names may not contain spaces.
es_es: Intentaste crear un nuevo alias global con el nombre {name}, pero ese nombre es un nombre de alias inválido. Los nombres de alias no pueden contener espacios.

source: A new global alias with the trigger `{name}` has been created.
es_es: Se ha creado un nuevo alias global con el archivo `{name}`.

source: Try to execute help for the base command of the alias.
es_es: Intente ejecutar ayuda para el comando base del alias.

source: {prefix}help {command}
es_es: {prefix}ayuda {command}

source: No such alias exists.
es_es: Un alias no existe.

source: Show what command the alias executes.
es_es: Mostrar qué comando ejecuta el alias.

source: The `{alias_name}` alias will execute the command `{command}`
es_es: El `{alias_name}` alias ejecutará el comando `{command}`

source: There is no alias with the name `{name}`
es_es: No hay alias con el nombre `{name}`

source: Delete an existing alias on this server.
es_es: Eliminar un alias existente en este servidor.

source: There are no aliases on this server.
es_es: No hay los aliases en este servidor.

source: Alias with the name `{name}` was successfully deleted.
es_es: Alias con el nombre `{name}` se eliminó correctamente.

source: Alias with name `{name}` was not found.
es_es: No se encontró el alias con el nombre `{name}`.

source: Delete an existing global alias.
es_es: Eliminar un alias global existente.

source: There are no aliases on this bot.
es_es: No hay el los alias dentro de este bot.

source: List the available aliases on this server.
es_es: Listar los alias disponibles en este servidor.

source: Aliases:
es_es: Alias:

source: List the available global aliases on this bot.
es_es: Lista de los alias globales disponibles en este bot.
