Repository: pypi-data/pypi-mirror-60
Catalog: packages/feincms-oembed/feincms_oembed-1.5.0-py2.py3-none-any.whl/feincms_oembed/locale/*/LC_MESSAGES/django.po
Languages: de

source: Insert an URL to an external content you want to embed, e.g. http://www.youtube.com/watch?v=Nd-vBFJN_2E
de: Hier eine URL eines externen Inhalts einfügen, z.B. http://www.youtube.com/watch?v=Nd-vBFJN_2E

source: external content
de: Externer Inhalt

source: external contents
de: Externe Inhalte

source: type
de: Typ

source: I don't know how to embed %s.
de: Ich weiss nicht wie ich %s einbetten soll.

source: Insert any RSS URL, e.g. https://www.djangoproject.com/rss/weblog/
de: Hier ein URL eines RSS-Feeds einfügen, z.B. https://www.djangoproject.com/rss/weblog/

source: SHA-1 hash of the URL.
de: SHA-1 Hash der URL.

source: Max. age in seconds
de: Maximales Alter in Sekunden

source: created
de: Erstellt

source: modified
de: Verändert

source: cached lookup
de: Zwischengespeicherte Einbettung

source: cached lookups
de: Zwischengespeicherte Einbettungen
