Repository: pypi-data/pypi-mirror-60
Catalog: packages/Red-DiscordBot/Red_DiscordBot-3.3.0-py3-none-any.whl/redbot/cogs/downloader/locales/*.po
Languages: cs_cz

source: You're about to add a 3rd party repository. The creator of Red and its community have no responsibility for any potential damage that the content of 3rd party repositories might cause.\n\nBy typing '**I agree**' you declare that you have read and fully understand the above message. This message won't be shown again until the next reboot.\n\nYou have **30** seconds to reply to this message.
cs_cz: Chystáte se přidat repositář třetí strany. Tvůrce bota Red a jeho komunita nenesou žádnou zodpovědnost za případné škody, které by mohl způsobit obsah repozitářů třetích stran.\n\nZadáním '**I agree**' prohlásíš, že jsi četl/a a plně jsi porozuměl výše uvedené zprávě. Tato zpráva se znovu nezobrazí až do dalšího restartování.\n\nMáte **30** sekund pro odpověď na tuto zprávu.

source: Your response has timed out, please try again.
cs_cz: Vypršel časový limit vaší odpovědi, opakujte akci.

source: No Downloader cog found.
cs_cz: Nenalezen Downloader cog.

source: That cog is not installed
cs_cz: Tento cog není nainstalován

source: Install a group of dependencies using pip.
cs_cz: Nainstalujte skupinu závislostí pomocí pip.

source: Libraries installed.
cs_cz: Nainstalované knihovny.

source: Some libraries failed to install. Please check your logs for a complete list.
cs_cz: Některé knihovny se nepodařilo nainstalovat. Prosím zkontrolujte logy pro kompletní seznam.

source: Repo management commands.
cs_cz: Příkazy pro správu repozitářů.

source: Add a new repo.\n\n The name can only contain characters A-z, numbers and underscores.\n The branch will be the default branch if not specified.\n
cs_cz: Přidá nový repozitář.\n\n Název může obsahovat pouze znaky A-z, čísla a podtržítka.\n Pokud nespecifikuješ branch, bude zvolena výchozí branch daného repozitáře.\n

source: That git repo has already been added under another name.
cs_cz: Tento git repozitář již byl přidán pod jiným názvem.

source: Something went wrong during the cloning process.
cs_cz: Během klonování repozitáře se něco pokazilo.

source: Repo `{name}` successfully added.
cs_cz: Repozitář `{name}` byl úspěšně přidán.

source: Remove a repo and its files.
cs_cz: Odstranit repozitář a jeho soubory.

source: The repo `{repo.name}` has been deleted successfully.
cs_cz: Repozitář `{repo.name}` byl úspěšně smazán.

source: List all installed repos.
cs_cz: Seznam všech nainstalovaných repozitářů.

source: Installed Repos:\n\n
cs_cz: Nainstalované repozitáře:\n\n

source: Show information about a repo.
cs_cz: Zobrazí informace o repozitáři.

source: Repo `{repo.name}` not found.
cs_cz: Repozitář `{repo.name}` nebyl nalezen.

source: Information on {repo.name}:\n{description}
cs_cz: Informace o {repo.name}:\n{description}

source: Cog installation management commands.
cs_cz: Příkazy pro správu instalace Cogů.

source: Install a cog from the given repo.
cs_cz: Nainstaluje cog z daného repozitáře.

source: Error: there is no cog by the name of `{cog_name}` in the `{repo.name}` repo.
cs_cz: Chyba: v repozitáři `{repo.name}` není žádný cog s názvem "{cog_name}".

source: This cog requires at least python version {version}, aborting install.
cs_cz: Tento cog vyžaduje verzi Pythonu alespoň {version}, přerušuji instalaci.

source: This cog requires at least Red version {min_version}
cs_cz: Tento cog vyžaduje minimální verzi Red Bota {min_version}

source: and at most {max_version}
cs_cz: a až maximálně {max_version}

source: , but you have {current_version}, aborting install.
cs_cz: , ale máte {current_version}, přerušuji instalaci.

source: Failed to install the required libraries for `{cog_name}`: {libraries}
cs_cz: Nepodařilo se nainstalovat požadované knihovny pro `{cog_name}`: {libraries}

source: Cog `{cog_name}` successfully installed. You can load it with `{prefix}load {cog_name}`
cs_cz: Cog `{cog_name}` byl úspěšně nainstalován. Můžete jej načíst pomocí `{prefix}load {cog_name}`

source: Uninstall cogs.\n\n You may only uninstall cogs which were previously installed\n by Downloader.\n
cs_cz: Odinstalujte cogy.\n\n Můžete odinstalovat pouze cogy, které byly dříve nainstalovány\n Downloaderem\n

source: Successfully uninstalled cogs:
cs_cz: Úspěšně odinstalované cogy:

source: \nThese cog were installed but can no longer be located:
cs_cz: \nTento cog byl dříve nainstalován, ale již nemůže být nalezen:

source: \nYou may need to remove their files manually if they are still usable. Also make sure you've unloaded those cogs with `{prefix}unload {cogs}`.
cs_cz: \nBudete je muset odstranit ručně. Také se ujistěte, že tyto cogy nejsou nahrány pomocí `{prefix}unload {cogs}`.

source: Update all cogs, or one of your choosing.
cs_cz: Aktualizuje všechny cogy, nebo jen některé dle výběru.

source: Cog update completed successfully.
cs_cz: Cog byl úspěšně aktualizován.

source: \nUpdated:
cs_cz: \nAktualizováno:

source: All installed cogs are already up to date.
cs_cz: Všechny nainstalované cogy jsou již aktuální.

source: None of the updated cogs were previously loaded. Update complete.
cs_cz: Žádný z aktualizovaných cogů nebyly dříve načteny. Aktualizace byla dokončena.

source: Would you like to reload the updated cogs?
cs_cz: Chceš znovu načíst aktualizované cogy?

source: OK then.
cs_cz: OK tedy.

source: List all available cogs from a single repo.
cs_cz: Zobrazí všechny dostupné cogy z daného repozitáře.

source: Installed Cogs:\n
cs_cz: Nainstalované cogy:\n

source: Available Cogs:\n
cs_cz: Dostupné cogy:\n

source: List information about a single cog.
cs_cz: Výpis informací o jednom cogu.

source: There is no cog `{cog_name}` in the repo `{repo.name}`
cs_cz: V repozitáři `{repo.name} není žádné cog se jménem `{cog_name}`

source: Information on {cog_name}:\n{description}\n\nRequirements: {requirements}
cs_cz: Informace o {cog_name}:\n{description}\n\nPožadavky: {requirements}

source: Missing from info.json
cs_cz: Nenalezen v info.json

source: Missing from installed repos
cs_cz: Nenalezen v nainstalovaných repozitářích

source: Command: {command}\nMade by: {author}\nRepo: {repo}\nCog name: {cog}
cs_cz: Příkaz: {command}\nAutor: {author}\nRepozitář: {repo}\nNázev cogu: {cog}

source: Find which cog a command comes from.\n\n This will only work with loaded cogs.\n
cs_cz: Zjistí, ze kterého cogu příkaz pochází.\n\n Funguje pouze s načtenými cogy\n

source: That command doesn't seem to exist.
cs_cz: Zdá se, že tento příkaz neexistuje.

source: Repo by the name \"{repo_name}\" does not exist.
cs_cz: Repozitář s názvem \"{repo_name}\" neexistuje.
