Repository: pypi-data/pypi-mirror-60
Catalog: packages/Red-DiscordBot/Red_DiscordBot-3.3.1-py3-none-any.whl/redbot/cogs/admin/locales/*.po
Languages: es_es, tr_tr, vi_vn

source: I attempted to do something that Discord denied me permissions for. Your command failed to successfully complete.
es_es: Intenté hacer algo para lo que Discord me negó permisos. Tu comando no pudo completarse correctamente.
tr_tr: Bir şey denemeye çalıştım ancak Discord izinlerim yeterli olmadı. Komutunuz işleme koyulamadı.
vi_vn: Lệnh của bạn không được thực hiện thành công vì discord đã từ chối quyền của tôi.

source: I tried to {verb} {role.name} to {member.display_name} but that role is higher than my highest role in the Discord hierarchy so I was unable to successfully add it. Please give me a higher role and try again.
es_es: Intenté {verb} {role.name} a {member.display_name} pero ese rol es más alto que mi rol en la jerarquía de Discord, por lo que no he podido añadirlo con éxito. Por favor dame un rol más alto y vuelve a intentarlo.
tr_tr: {verb}{member.display_name} kişisine {role.name} rolünü vermeye çalıştım ancak bu rol benim rolümü aştığından bu rolü veremedim. Bana daha yüksek bir rol verdikten sonra tekrar deneyin.
vi_vn: Tôi đã thử {verb} {role.name} với {member.display_name} nhưng vì quyền của {member.display_name} cao hơn của tôi, xin hãy cho tôi quyền cao hơn và thử lại.

source: I tried to {verb} {role.name} to {member.display_name} but that role is higher than your highest role in the Discord hierarchy so I was unable to successfully add it. Please get a higher role and try again.
es_es: Intenté {verb} {role.name} a {member.display_name} pero ese rol es más alto que tu rol más alto en la jerarquía de Discord, por lo que no he podido añadirlo con éxito. Por favor consigue un rol más alto y vuelve a intentarlo.
tr_tr: {verb}{member.display_name} kişisine {role.name} rolünü vermeye çalıştım ancak bu rol benim rolümü aştığından bu rolü veremedim. Bana daha yüksek bir rol verdikten sonra tekrar deneyin.
vi_vn: Tôi đã thử {verb} {role.name} với {member.display_name} nhưng vì quyền của {member.display_name} cao hơn của bạn, xin hãy lấy một quyền cao hơn và thử lại.

source: I tried to edit {role.name} but that role is higher than your highest role in the Discord hierarchy so I was unable to successfully add it. Please get a higher role and try again.
es_es: He intentado agregar {role.name} a pero ese rol es más alto que mi rol en la jerarquía de Discord, por lo que no he podido añadirlo con éxito. Por favor dame un rol más alto y vuelva a intentarlo.
tr_tr: {role.name} rolünü düzenlemeye çalıştım ancak senin rolün bu rolden aşağı da olduğu için düzenleyemedim. Lütfen daha yüksek bir rolünüz olduğunda tekrar deneyin.
vi_vn: Tôi đã thử chỉnh {role.name} nhưng vì quyền đó cao hơn quyền của bạn trong discord vì vậy tôi không thể chỉnh được, xin hãy lấy một quyền cao hơn và thử lại.

source: I am already announcing something. If you would like to make a different announcement please use `{prefix}announce cancel` first.
es_es: Ya estoy anunciando algo. Si quieres hacer un anuncio diferente, por favor usa `{prefix}announce cancel` primero.
tr_tr: Zaten şuan da bir duyuru yapmaktayım. Başka bir duyuru yapmak istiyorsanız lütfen bu komutu kullanın: `{prefix}announce cancel`.
vi_vn: Tôi đang thông báo lúc này. Nếu bạn muốn làm một thông báo khác hãy sử dụng lệnh `{prefix}announce cancel` trước.

source: A collection of server administration utilities.
es_es: Una colección de utilidades de administración de servidores.
tr_tr: Sunucu yönetimiyle ilgili.
vi_vn: Một tập hợp các dụng cụ cho việc quản lý server.

source: add
es_es: añadir
tr_tr: ekle
vi_vn: thêm vào

source: I successfully added {role.name} to {member.display_name}
es_es: He añadido con éxito {role.name} a {member.display_name}
tr_tr: {role.name} rolünü {member.display_name} kişisine başarılı bir şekilde ekledim
vi_vn: Đã thêm thành công vai trò{role.name} cho {member.display_name}

source: remove
es_es: eliminar
tr_tr: kaldır
vi_vn: gỡ bỏ

source: I successfully removed {role.name} from {member.display_name}
es_es: He retirado con éxito {role.name} de {member.display_name}
tr_tr: {role.name} rolünü {member.display_name} kişisine başarılı bir şekilde kaldırdım.
vi_vn: Đã xóa thành công vai trò{role.name} từ {member.display_name}

source: Add a role to a user.\n\n If user is left blank it defaults to the author of the command.\n
es_es: Añadir un rol a un usuario.\n\n Si el usuario se deja en blanco, por defecto se convierte en autor del comando.\n
tr_tr: Kullanıcıya rol ekler. \n\n Kullanıcı kısmı boş bırakıldıysa komut sahibine ekler.\n
vi_vn: Thêm vai trò cho người dùng.\n\n Nếu người dùng để trống thì được chỉnh về mặc định theo như người viết lệnh.\n

source: Remove a role from a user.\n\n If user is left blank it defaults to the author of the command.\n
es_es: Eliminar un rol de un usuario.\n\n Si el usuario se deja en blanco, por defecto se convierte en autor del comando.\n
tr_tr: Kullanıcıdan rol kaldırır.\n\n Kullanıcı kısmı boş bırakıldıysa komut sahibinden kaldırır.\n
vi_vn: Đã xóa thành công vai trò của người dùng.\n\n Nếu người dùng để trống thì được chỉnh về mặc định theo như người viết lệnh.\n

source: Edit role settings.
es_es: Editar configuración de rol.
tr_tr: Rol ayarlarını düzenle
vi_vn: Chỉnh quyền của vai trò.

source: Edit a role's colour.\n\n Use double quotes if the role contains spaces.\n Colour must be in hexadecimal format.\n [Online colour picker](http://www.w3schools.com/colors/colors_picker.asp)\n\n Examples:\n `[p]editrole colour \"The Transistor\" #ff0000`\n `[p]editrole colour Test #ff9900`\n
es_es: Editar el color de un rol.\n\n Usa comillas dobles si el rol contiene espacios.\n El color debe estar en formato hexadecimal.\n [Selector de colores en línea](http://www.w3schools.com/colors/colors_picker.asp)\n\n Ejemplos:\n `[p]color de papel de edición \"The Transistor\" #ff0000`\n `[p]edición role colour Test #ff9900`\n \n
tr_tr: Rol rengini düzenler.\n\n Rol boşluk içeriyorsa çift tırnak kulanın.\n Renk hexadecimal formatında olmalıdır.\n [Online colour picker](http://www.w3schools.com/colors/colors_picker.asp)\n\n Örneğin:\n `[p]editrole colour \"The Transistor\" #ff0000`\n `[p]editrole colour Test #ff9900`\n
vi_vn: Đổi màu của vai trò.\n\n Dùng dấu ngoặc kép cho vai trò nếu trong vai trò có dấu cách.\n Màu phải được theo mã hex.\n [Website chọn màu](http://www.w3schools.com/colors/colors_picker.asp)\n\n Ví dụ:\n `[p]editrole colour \"Địt mẹ wibu\" #ff0000`\n `[p]editrole colour "Địt mẹ thằng jew\" #ff9900`\n

source: Done.
es_es: Listo.
tr_tr: Tamamdır.
vi_vn: Xong!

source: Edit a role's name.\n\n Use double quotes if the role or the name contain spaces.\n\n Examples:\n `[p]editrole name \"The Transistor\" Test`\n
es_es: Editar el nombre de un rol.\n\n Usa comillas si el rol o el nombre contienen espacios.\n\n Ejemplos:\n `[p]editrole name \"El Transistor\" Prueba`\n
tr_tr: Rolün ismini düzenler.\n\n Rol boşluk içeriyorsa çift tırnak kulanın.\n\n Örneğin:\n `[p]editrole name \"The Transistor\" Test`\n
vi_vn: Thay đổi tên của vai trò.\n\n Dùng dấu ngoặc kép cho vai trò nếu trong vai trò có dấu cách.\n\n Ví dụ:\n `[p]editrole name \"Địt mẹ Wibu\" Test`\n

source: Announce a message to all servers the bot is in.
es_es: Anunciar un mensaje a todos los servidores en los que está el bot.
tr_tr: Botun bulunduğu tüm sunuculara duyuru geçer.
vi_vn: Thông báo một thông báo tới tất cả các server mà con bot ở trong.

source: The announcement has begun.
es_es: El anuncio ha comenzado.
tr_tr: Duyuru başladı.
vi_vn: Sự kiện {0} đã được bắt đầu.

source: Cancel a running announce.
es_es: Cancelar un anuncio en ejecución.
tr_tr: Şuan yapılan duyuruyu iptal eder.
vi_vn: Hủy một thông báo đang chạy.

source: The current announcement has been cancelled.
es_es: El anuncio fue cancelado.
tr_tr: Şuan yapılan duyuru iptal edildi.
vi_vn: Thông báo đang chạy đã được hủy.

source: Change the channel to which the bot makes announcements.
es_es: Cambia el canal al que el bot hace anuncios.
tr_tr: Botun duyuru yaptığı kanalı değiştirir.
vi_vn: Đổi kênh thông báo của bot.

source: The announcement channel has been set to {channel.mention}
es_es: El canal de anuncio se ha establecido en {channel.mention}
tr_tr: {channel.mention} duyuru kanalı olarak ayarlandı
vi_vn: Kênh thông báo đã được đổi sang {channel.mention}

source: Toggle announcements being enabled this server.
es_es: Alternar anuncios habilitados en este servidor.
tr_tr: Duyuru sistemi bu sunucu için aktif edildi.
vi_vn: Thông báo đang được bật trong server này.

source: The server {guild.name} will receive announcements.
es_es: El servidor {guild.name} recibirá anuncios.
tr_tr: {guild.name} sunucusu duyuruları alacak.
vi_vn: Sever{guild.name}sẽ được nhận thông báo.

source: The server {guild.name} will not receive announcements.
es_es: El servidor {guild.name} no recibirá anuncios.
tr_tr: {guild.name} sunucusu duyuruları almayacak.
vi_vn: Sever{guild.name}sẽ không được nhận thông báo.

source: Add a role to yourself.\n\n Server admins must have configured the role as user settable.\n\n NOTE: The role is case sensitive!\n
es_es: Añadir un rol a ti mismo.\n\n Los administradores del servidor deben haber configurado el rol como usuario configurable.\n\n NOTA: El rol es sensible a mayúsculas!\n
tr_tr: Kendine rol ekler.\n\n Sunucu yöneticileri kullanıcının kullanabileceği şekilde ayarlamalıdır.\n\n NOT: Rol büyük küçük harf duyarlıdır!\n
vi_vn: Thêm vài trò cho mình.\n\n Admin của server này đã để cho bạn có thể tự đặt vai trò cho mình.\n\n Lưu ý: Phải phân biệt chữ hoa chữ thường cho vai trò\n

source: Remove a selfrole from yourself.\n\n NOTE: The role is case sensitive!\n
es_es: Eliminar un selfrole de ti mismo.\n\n NOTA: El rol es sensible a las mayúsculas!\n
tr_tr: Selfrole'ü kendinden kaldır.\n\n NOT: Rol büyük küçük harf duyarlıdır!\n
vi_vn: Gỡ bỏ vai trò tự thêm bằng lệnh.\n\n Lưu ý: Phải phân biệt chữ hoa chữ thường cho vai trò!\n

source: Add a role to the list of available selfroles.\n\n NOTE: The role is case sensitive!\n
es_es: Añade un rol a la lista de selfroles disponibles.\n\n NOTA: El rol es sensible a las mayúsculas!\n
tr_tr: Selfrole listesine rol ekler.\n\n NOT: Rol büyük küçük harf duyarlıdır!\n
vi_vn: Thêm một vai trò vào danh sách vai trò tự thêm.\n\n Lưu ý: Phải phân biệt chữ hoa chữ thường cho vai trò!\n

source: The selfroles list has been successfully modified.
es_es: La lista de selfroles ha sido modificada con éxito.
tr_tr: Selfrole listesi başarılı bir şekilde değiştirildi.
vi_vn: Danh sách vai trò tự thêm đã được chỉnh sửa thành công.

source: Remove a role from the list of available selfroles.\n\n NOTE: The role is case sensitive!\n
es_es: Eliminar un rol de la lista de las selfroles disponibles.\n\n NOTA: El rol es sensible a mayúsculas!\n
tr_tr: Selfrole listesinden rol çıkarır.\n\n NOT: Rol büyük küçük harf duyarlıdır!\n
vi_vn: Gỡ bỏ vai trò tự thêm từ danh sách các vai trò tự thêm.\n\n Lưu ý: Phải phân biệt chữ hoa chữ thường cho vai trò!\n

source: \n Lists all available selfroles.\n
es_es: \n Lista todos los selfroles disponibles.\n
tr_tr: \n Kullanılabilir selfrol'leri listeler.\n
vi_vn: \n Hiển thị hết tất cả các vai trò tự thêm.\n

source: Available Selfroles:\n{selfroles}
es_es: Selfroles disponibles:\n{selfroles}
tr_tr: Kullanılabilir Selfrol'ler:\n{selfroles}
vi_vn: Vai trò tự thêm:\n{selfroles}

source: Lock a bot to its current servers only.
es_es: Bloquea un bot sólo a sus servidores actuales.
tr_tr: Botu şuan bulunduğu sunucularda kilitler.
vi_vn: Khóa lệnh bot cho server hiện tại.

source: The bot is no longer serverlocked.
es_es: El bot ya no está bloqueado por el servidor.
tr_tr: Bot artık sunucular da kilitli değil

source: The bot is now serverlocked.
es_es: El bot está bloqueado por el servidor.
tr_tr: Bot şuan sunucularda kilitli.

source: I could not announce to server: {server.id}
es_es: No pude anunciar en servidor: {server.id}
tr_tr: {server.id} sunucusunda duyuru yapamadım.

source: The Admin cog is not loaded.
es_es: El cog Admin no está cargado.
tr_tr: The Admin eklentisi yüklenmedi.

source: The provided role is not a valid selfrole.
es_es: El rol proporcionado no es un selfrole válido.
tr_tr: Girilen selfrol geçerli değil.
