Repository: pypi-data/pypi-mirror-60
Catalog: packages/Red-DiscordBot/Red-DiscordBot-3.3.1.tar.gz/Red-DiscordBot-3.3.1/redbot/cogs/cleanup/locales/*.po
Languages: fr_fr

source: Commands for cleaning up messages.
fr_fr: Commandes pour supprimer des messages.

source: Are you sure you want to delete {number} messages? (y/n)
fr_fr: Êtes vous sûr de supprimer {number} messages ? (y/n)

source: Cancelled.
fr_fr: Annulé.

source: Delete messages.
fr_fr: Supprime les messages.

source: Delete the last X messages matching the specified text.\n\n Example:\n `[p]cleanup text \"test\" 5`\n\n Remember to use double quotes.\n
fr_fr: Supprime les X derniers messages correspondant au texte spécifié.\n\n Exemple :\n `[p]cleanup text \"test\" 5`\n\n N'oubliez pas d'utiliser des guillemets.\n

source: Delete the last X messages from a specified user.\n\n Examples:\n `[p]cleanup user @​Twentysix 2`\n `[p]cleanup user Red 6`\n
fr_fr: Supprime les X derniers messages d'un utilisateur spécifié.\n\n Exemples :\n `[p]cleanup user @​Twentysix 2`\n `[p]cleanup user Red 6`\n

source: Delete all messages after a specified message.\n\n To get a message id, enable developer mode in Discord's\n settings, 'appearance' tab. Then right click a message\n and copy its id.\n
fr_fr: Supprimer tous les messages après un message spécifié.\n\n Pour obtenir l'Id d'un message, activez le mode développeur\n dans l'onglet "Apparence" des paramètres de Discord.\n Ensuite faites clic droit sur un message et\n "Copier l'identifiant"

source: Message not found.
fr_fr: Message introuvable.

source: Deletes X messages before specified message.\n\n To get a message id, enable developer mode in Discord's\n settings, 'appearance' tab. Then right click a message\n and copy its id.\n
fr_fr: Supprime X messages avant un message spécifié.\n\n Pour obtenir l'Id d'un message, activez le mode développeur\n dans l'onglet "Apparence" des paramètres de Discord.\n Ensuite faites clic droit sur un message et\n "Copier l'identifiant"

source: Delete the messages between Messsage One and Message Two, providing the messages IDs.\n\n The first message ID should be the older message and the second one the newer.\n\n Example:\n `[p]cleanup between 123456789123456789 987654321987654321`\n
fr_fr: Supprimez les messages entre deux messages, en fournissant l'ID des messages.\n\n Le premier ID de message doit être l'ancien message et le second le plus récent.\n\n Exemple :\n `[p]cleanup between 123456789123456789 987654321987654321`\n

source: Delete the last X messages.\n\n Example:\n `[p]cleanup messages 26`\n
fr_fr: Supprime les X derniers messages.\n\n Exemple :\n `[p]cleanup messages 26`\n

source: Clean up command messages and messages from the bot.
fr_fr: Supprime les messages de commandes et les messages venant du bot.

source: Clean up messages owned by the bot.\n\n By default, all messages are cleaned. If a third argument is specified,\n it is used for pattern matching: If it begins with r( and ends with ),\n then it is interpreted as a regex, and messages that match it are\n deleted. Otherwise, it is used in a simple substring test.\n\n Some helpful regex flags to include in your pattern:\n Dots match newlines: (?s); Ignore case: (?i); Both: (?si)\n
fr_fr: Supprimer les messages appartenant au bot.\n\n Par défaut, tous les messages sont supprimés. Si un troisième argument est spécifié,\n il est utilisé pour la comparaison de motifs : S'il commence par r( et se termine par ),\n alors il est interprété comme un regex, et les messages qui y correspondent sont les suivants\n effacé. Sinon, il est utilisé dans un simple test de sous-chaîne.\n\n Quelques examples regex utiles à inclure dans votre motif :\n Les points correspondent aux nouvelles lignes : (?s) ; Ignorer le cas : (?i) ; Les deux : (?si)\n

source: {} doesn't look like a valid message ID.
fr_fr: {} ne ressemble pas à un ID de message valide.
