Repository: pypi-data/pypi-mirror-60
Catalog: packages/collective.captchacontactinfo/collective.captchacontactinfo-1.2.2.tar.gz/collective.captchacontactinfo-1.2.2/collective/captchacontactinfo/locales/*/LC_MESSAGES/collective.captchacontactinfo.po
Languages: fr

source: Captcha Contact Info
fr: Formulaire de contact avec Captcha

source: Captcha not configured
fr: Captcha non configuré

source: Contact-info Configuration
fr: Configuration du formulaire de contact avec Captcha

source: Contact-info settings
fr: Paramètres du formulaire

source: Installs the collective.captchacontactinfo package
fr: Installe collective.captchacontactinfo

source: contactinfo-config-policy
fr: Politique de confidentialité

source: contactinfo-config-policyhelp
fr: Renseignez le chemain de la page à utiliser pour le texte de Politique de confidentialité. Par exemple: dossier-a/confidentialité

source: help_subject
fr: Veuillez saisir le sujet du message que vous souhaitez envoyer.

source: label_captcha
fr: Protection anti-spam

source: policy_link
fr: Cliquez ici pour consulter notre Politique de Confidentialité relative au traitement de vos données.
